
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner Scan = new Scanner(System.in);

        System.out.print("Введите дату:");
        String data = Scan.nextLine();

        if (data.matches("(0[1-9]|[12][0-9]|3[01])\\/(0[1-9]|1[012])\\/([2-9][0-9]{3}|19[0-9]{2})"))
            System.out.print("Введенное выражение является датой");
        else if (data.matches("([4-9][0-9]|3[2-9])\\/(1[3-9]|[2-9][0-9])\\/(0[0-9]{3}|1[0-8][0-9]{2})"))
            System.out.print("Введенное выражение не является датой");
        else if (data.matches("([4-9][0-9]|3[2-9])\\/(0[1-9]|1[012])\\/(0[0-9]{3}|1[0-8][0-9]{2})"))
            System.out.print("Введенное выражение не является датой");
        else if (data.matches("([4-9][0-9]|3[2-9])\\/(1[3-9]|[2-9][0-9])\\/([2-9][0-9]{3}|19[0-9]{2})"))
            System.out.print("Введенное выражение не является датой");
        else if (data.matches("([4-9][0-9]|3[2-9])\\/(0[1-9]|1[012])\\/([2-9][0-9]{3}|19[0-9]{2})"))
            System.out.print("Введенное выражение не является датой");
        else if (data.matches("(0[1-9]|[12][0-9]|3[01])\\/(1[3-9]|[2-9][0-9])\\/(0[0-9]{3}|1[0-8][0-9]{2})"))
            System.out.print("Введенное выражение не является датой");
        else if (data.matches("(0[1-9]|[12][0-9]|3[01])\\/(0[1-9]|1[012])\\/(0[0-9]{3}|1[0-8][0-9]{2})"))
            System.out.print("Введенное выражение не является датой");
        else if (data.matches("(0[1-9]|[12][0-9]|3[01])\\/(1[3-9]|[2-9][0-9])\\/([2-9][0-9]{3}|19[0-9]{2})"))
            System.out.print("Введенное выражение не является датой");
        else
            System.out.print("Введенное выражение не соответствует формату");

    }
}
